In [1]:
import pandas as pd

In [14]:
movies = pd.read_csv('movies.csv')

In [15]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [16]:
ratings = pd.read_csv('ratings.csv')

In [17]:
ratings.head()

   userId  movieId  rating   timestamp
0       1        1     4.0  1225734739
1       1      110     4.0  1225865086
2       1      158     4.0  1225733503
3       1      260     4.5  1225735204
4       1      356     5.0  1225735119

In [18]:
ratings_groupby = (ratings[ratings.rating == 5.0]).groupby('movieId').count().sort_values('rating',ascending=False).head(1)

In [19]:
x = ratings_groupby.merge(movies, on ='movieId', how ='left')
x.head()

,movieId,userId,rating,timestamp,title,genres
0,318,59885,59885,59885,"Shawshank Redemption, The (1994)",Crime|Drama

In [20]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [25]:
ppower = power[ ((power['country']=='Latvia') | (power['country']=='Lithuania') | (power['country']=='Estonia')) & 
        ((power['category']==4) | (power['category']==12) | (power['category']==21)) & 
        ((power['year'] >= 2005) & (power['year'] <= 2010)) &
        (power['quantity'] > 0)].groupby('country').sum('quantity')
ppower.head()

             year  quantity  category
country
Estonia    162590   63440.0      1446
Latvia     142533   54844.0      1491
Lithuania  391484  122296.0      3006

In [22]:
ppower[['quantity']].sort_values(by='quantity',ascending=False)

           quantity
country
Lithuania  122296.0
Estonia     63440.0
Latvia      54844.0

In [23]:
pip install html5lib

Defaulting to user installation because normal site-packages is not writeable
Looking in links: /usr/share/pip-wheels
Requirement already satisfied: html5lib in /home/de541e16-2bc7-48de-8c43-968484315b23/.local/lib/python3.11/site-packages (1.1)
Requirement already satisfied: six>=1.9 in /opt/conda/envs/anaconda-panel-2023.05-py310/lib/python3.11/site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in /opt/conda/envs/anaconda-panel-2023.05-py310/lib/python3.11/site-packages (from html5lib) (0.5.1)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
aaa = pd.read_html('https://cbr.ru/currency_base/daily/')